In [1]:
import os
import pandas as pd
os.chdir('py-master\py-master\pandas')
os.chdir('8_concat')

In [4]:
india_weather = pd.DataFrame({
    'city':['mumbai', 'delhi', 'banglore'],
    'temperature': [32, 45, 80],
    'humidity' : [80, 60, 78]
})
india_weather

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           80

In [6]:
us_weather = pd.DataFrame({
    'city':['new york', 'chicago', 'orlando'],
    'temperature': [21, 14, 35],
    'humidity' : [68, 65, 75]
})
us_weather

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [8]:
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           80
3  new york        68           21
4   chicago        65           14
5   orlando        75           35

In [9]:
df = pd.concat([india_weather, us_weather], keys=['india', 'us'])
df

             city  humidity  temperature
india 0    mumbai        80           32
      1     delhi        60           45
      2  banglore        78           80
us    0  new york        68           21
      1   chicago        65           14
      2   orlando        75           35

In [10]:
df.loc['us']

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [11]:
df.loc['india']

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           80

In [19]:
temperature_df = pd.DataFrame({
    'city':['mumbai', 'delhi', 'banglore'],
    'temperature': [32, 45, 80]}, index=[0, 1, 2])

temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           80

In [20]:
windspeed_df = pd.DataFrame({
    'city':['delhi', 'mumbai'],
    'windspeed': [7, 12]},
index=[1, 0])

windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [21]:
df= pd.concat([temperature_df, windspeed_df], axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           80     NaN        NaN

In [22]:
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           80

In [23]:
s = pd.Series(['Humid', 'Dry', 'Rain'],name='event')

In [24]:
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [25]:
df = pd.concat([temperature_df, s], axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           80   Rain